#include <bits/stdc++.h>
using namespace std;


int main(){
    int l, r;
    cin >> l >> r;

    int len = r - l + 1;
    int odd = len/2 + ((l%2 && r%2) ? 1 : 0), even = 0;
    even = r/4 - l/4 + (l%4 == 0 ? 1 : 0);

    cout << odd + even;

}
/* 11 13 15 17 12 16
   13 15 17 19 12 16

2 = x
4 = 2 - 0
6 = x
8 = 3 - 1
10 = x
12 = 4 - 2
14 = x
16 = 5 - 3
18 = x
20 = 6 - 4
22 = x
24 = 7 - 5
思路就是，在区间[l, r]里一共有r - l + 1个数字
其中所有奇数都满足是平方差
偶数要想满足，就需要有两个质因数是2
也就是得是4的倍数，
所以我的目的就是统计在[l, r]中有多少奇数，有多少偶数是4的倍数
*/